Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: དེ་སངས་རྒྱས་ཀྱི་ཞིང་གང་དུ་རྐང་པ་བཞག་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སེམས་ཅན་དག་སངས་རྒྱས་བྱུང་བར་ཡང་དག་པར་རབ་ཏུ་ཤེས་སོ། །
en: Whenever the bodhisattva set his foot in a given buddha realm, the beings there understood that a buddha had appeared.

source: བདུད་ཀྱི་གནས་དག་ནི་སྤ་བཀོང་བར་གྱུར་ཅིང་།
en: The realms of the māras would become subdued,

source: ལྷའི་གནས་དག་ནི་རབ་ཏུ་དགའ་བར་གྱུར་ཏེ།
en: the realms of the gods rejoiced,

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ཐམས་ཅད་ཀྱང་འོད་གསེར་གྱི་མདོག་གིས་ཁྱབ་པར་གྱུར་ཏོ། །
en: and all the buddha realms became bathed in a golden light .

source: དེ་ནས་སེམས་ཅན་དེ་དག་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སྣང་བ་འདི་དག་ཕྱོགས་གང་ནས་འོངས་ཞེས་ཡ་མཚན་དུ་གྱུར་ཏོ། །
en: When this happened the beings of the realm were amazed and wondered, ‘Where does this light come from?’

source: དེ་ནས་བར་སྣང་ལས་སངས་རྒྱས་ཀྱི་ཞིང་འདི་དག་ཐམས་ཅད་ནི་དེ་བཞིན་གཤེགས་པའི་སྣང་བས་ཁྱབ་སྟེ།
en: A voice could then be heard from the sky, telling them, ‘The buddha realms are all pervaded by the light of the thus-gone ones.

source: གང་དེ་བཞིན་གཤེགས་པ་མཐོང་བར་འདོད་པ་དེ་དག་ཐལ་མོ་སྦྱོར་ལ་དེ་བཞིན་གཤེགས་པ་མཐོང་བར་སྨྲོས་ཤིག་དང་།
en: Those wishing to see a thus-gone one should join their palms and say so.

source: དེ་དག་གིས་དེ་བཞིན་གཤེགས་པ་མཐོང་ངོ་ཞེས་སྒྲ་བྱུང་ངོ་། །
en: You will then behold a thus-gone one.’

source: དེ་ནས་སེམས་ཅན་དེ་དག་གིས་སྒྲ་དེ་ཐོས་ནས་བར་སྣང་ལ་ཐལ་མོ་སྦྱར་ཏེ།
en: “When they had heard these words the people joined their palms, looked up into the sky, and said,

source: ཁྱོད་ཀྱིས་བདག་ཅག་དེ་བཞིན་གཤེགས་པ་དང་ལྷན་ཅིག་སྤྲོད་ཅིག་ཅེས་སྒྲ་ཕྱུང་ངོ་། །
en: ‘Please let us meet a thus-gone one!’

source: དེ་དག་ལ་དེ་བཞིན་གཤེགས་པ་དེའི་སྤྲུལ་པ་བྱེ་བ་བརྒྱ་ཕྲག་སྟོང་དག་མངོན་པར་སྤྲུལ་ཏེ།
en: At that point a trillion emanations of the thus-gone ones were produced,

source: སེམས་ཅན་རེ་རེས་སྤྲུལ་པ་རེ་རེ་ཡང་དག་པར་ཤེས་ཀྱིས་སྤྲུལ་པ་གཞན་ནི་མ་མཐོང་ངོ་། །
en: and each of those emanations was perceptible to one being only.

source: དེའི་ཉི་མ་གཅིག་གི་འོད་ཀྱི་དཀྱིལ་འཁོར་གྱི་སྣང་བས་སངས་རྒྱས་ཀྱི་ཞིང་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་རྣམས་སུ་བྱང་ཆུབ་སེམས་དཔའ་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དག་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ། །
en: For one day this sphere of light kept shining throughout innumerably many tens of thousands of buddha realms, making innumerably many tens of thousands of bodhisattvas become irreversible.

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་འོད་མཐའ་ཡས་བྱང་ཆུབ་སེམས་དཔའ་གཟི་བརྗིད་དྲག་པའི་མཐུ་དང་སྟོབས་དང་། བརྩོན་འགྲུས་བསྐྱེད་པར་མཛད་པ་ན་བྱང་ཆུབ་སེམས་དཔའ་གཟི་བརྗིད་དྲག་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: “Since the bodhisattva Noble Splendor demonstrated such power, strength, and diligence, the thus-gone Anantaprabha said to him,

source: རིགས་ཀྱི་བུ་སོང་ལ་ངའི་འོད་ཀྱི་རྗེས་སྙོགས་ཤིག །
en: ‘Noble son, come, follow my light.

source: གང་དུ་ངའི་འོད་གནས་པར་མཐོང་བ་དེ་ཙམ་དུ་ངའི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་ཤེས་པར་གྱིས་ཤིག །
en: Understand that my buddha realm extends as far as you can see my radiance.’

source: དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཉིད་ཀྱི་འོད་གསེར་གྱི་ཁ་དོག་བཏང་ངོ་། །
en: “The Blessed One then sent forth a golden light ,

source: དེ་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་འོད་དེ་དག་གི་རྗེས་སུ་སོང་ངོ་། །
en: and the bodhisattva Noble Splendor followed it by means of his miraculous powers .

source: དེ་བསྐལ་པ་གྲངས་མེད་པར་འོད་དེ་དག་གི་རྗེས་སུ་སོང་ཡང་འོད་དེའི་གནས་མ་མཐོང་ངོ་། །
en: In this way the bodhisattva traveled for an incalculable eon, yet he still did not see the source of the light.

source: དེ་བསྐལ་པ་གྲངས་མེད་པར་སོང་བས་ལུས་སྙོམ་ཞིང་སྒྱིད་ལུག་གོ། །
en: Having traveled for an incalculable eon, he felt physically fatigued and weary.

source: དེ་ནས་བར་སྣང་ལས་སངས་རྒྱས་ཀྱི་སྐུ་བྱུང་ནས་དེ་ལ་བཀའ་སྩལ་པ།
en: Yet at that point the form of the Buddha appeared in the sky before him and said,

source: རིགས་ཀྱི་བུ་ངལ་བའི་རྒྱུ་ཡིད་ལ་མ་བྱེད་ཅིག་སྒྱིད་ལུག་པར་མ་བྱེད་པར་རེ་ཞིག་ཅུང་ཞིག་རིང་དུ་སོང་ཤིག །
en: ‘Noble son, do not let your mind become exhausted and weary. Travel on for a bit more.’

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་མཐའ་ཡས་ཀྱིས་ཇི་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་མཛད་པ་མངོན་པར་འདུ་མཛད་དེ
en: “At that point the thus-gone, worthy, perfect buddha Anantaprabha performed a miraculous feat and so,

source: དེ་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་མཛད་པ་མངོན་པར་འདུ་མཛད་པས་དེའི་ལུས་ཀྱི་ངལ་བ་བསལ་ནས་ལུས་དང་སེམས་ཀྱི་བརྩོན་འགྲུས་སངས་རྒྱས་ཀྱི་མཐུས་ཡང་དག་པར་འདུས་སོ། །
en: by this miraculous feat, the bodhisattva’s physical fatigue was dispelled and the power of the Buddha imbued his body and mind with diligence.

source: དེ་ཡང་བསྐལ་པ་གྲངས་མེད་པར་སོང་བ་དང་།
en: In this way the bodhisattva Noble Splendor traveled on for another incalculable eon.

source: རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཤིང་ལྗོན་པ་ཞིག་མཐོང་སྟེ། དེའི་ཕ་རོལ་ན་འོད་མཐོང་ངོ་། །
en: Finally, he came to a tree made of the seven precious substances and noticed that the light was shining from behind the tree.

source: དེ་དེའི་ཚེ་བླ་གོས་ཕྱོགས་གཅིག་ཏུ་གཟར་ཏེ། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ནས་དེ་བཞིན་གཤེགས་པ་འོད་མཐའ་ཡས་དེ་ལ་ཚིགས་སུ་བཅད་དེ་གསོལ་པ།
en: At that point he draped his shawl over one shoulder, knelt on his right knee, and spoke in verse to the thus-gone Anantaprabha:

source: ཐུགས་ལ་དྲི་མ་བྲལ་ཞིང་སྦྱོར་བ་སྤངས། །ཁྱོད་ཀྱིས་འཇིག་རྟེན་ཁམས་ཀུན་ཐུགས་སུ་ཆུད། །
en: “ ‘With your stainless mind that has abandoned all ties You comprehend all the realms of the world.

source: འདྲེན་པ་ཁྱོད་ཀྱི་འོད་ནི་ཅི་འདྲ་བ། །འདི་ལ་ཡུལ་གྱི་མཐའ་འདི་རྗེས་སུ་འཇུག །
en: Guide, I follow your light Wherever it reaches!’

source: དེའི་ཚེ་བར་སྣང་ལས་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཁང་པ་བརྩེགས་པ་ཞིག་བྱུང་སྟེ།
en: “In the sky before him now manifested a mansion made of the seven precious substances.

source: ཁང་པ་བརྩེགས་པ་དེར་སངས་རྒྱས་ཀྱི་གཟུགས་བྱུང་སྟེ། དེས་བྱང་ཆུབ་སེམས་དཔའ་གཟི་བརྗིད་དྲག་པ་དེ་ལ་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ།
en: Within the mansion he saw the form of the Buddha, who then spoke these verses to him:

source: གང་དག་ང་ཡི་རྐང་པའི་དྲུང་འདུག་དང་། །གང་དག་ཡུལ་འདི་ཡི་ནི་མཐར་འདུག་པ། །ཐམས་ཅད་ང་ཡི་སྒྲ་དག་ཐོས་འགྱུར་ཏེའདི་ཡི་སྒྲུབ་པ་ཐམས་ཅད་ཤེས་པར་འགྱུར། །
en: “ ‘Whoever is at my feet, And whoever is at the end of this realm, They will all hear my voice And comprehend all the practices.

source: སྟོབས་བཅུ་སངས་རྒྱས་ཆོས་ནི་མ་འདྲེས་པ། །
en: “ ‘The buddha qualities of the ten powers are unique;

source: བརྟན་པ་འདི་དག་སྲོག་ཆགས་ཀུན་ལ་བདེན། །
en: Steadfast one, they are true for all living beings.

source: ཡུལ་གྱི་རང་བཞིན་ཡུལ་གྱི་དངོས་དང་བཟོ། །དེ་བཞིན་ཡུལ་གྱི་ཚིག་དག་ཀུན་ཤེས་སོ། །
en: The nature and character of objects, the sciences, And the words that concern objects—all of this I understand.

source: རྒྱལ་བ་ང་ཡི་ཞིང་འདིར་སེམས་ཅན་དག །ཚིག་འདི་ཐོས་ནས་དང་བར་མི་འགྱུར་མེད། །
en: “ ‘When the beings in this realm of mine hear these words That I, the Victor, speak, they cannot but have faith.

source: ཐམས་ཅད་བླ་ན་མེད་པའི་ས་ལ་གནས། །དེ་དག་རྒྱལ་བའི་ཆོས་ལས་ལྡོག་མི་འགྱུར། །
en: Everyone will come to dwell upon the unsurpassed stage And be irreversible from the qualities of the victorious ones.

source: གང་དག་ཉན་ཐོས་ལྷན་ཅིག་ཐུན་མོང་བའི། །དེ་དག་མ་ཡིན་འདི་ནི་རྣམ་འདྲེན་ཆོས། །
en: “ ‘The qualities of the great guides Are not shared in common with the hearers.

source: རྒྱལ་སྲས་གང་ལ་རབ་ཏུ་སེམས་དང་བ། །བདུད་ཀྱི་སྐྱོན་བཅོམ་བྱང་ཆུབ་རེག་པར་འགྱུར། །
en: The child of the victorious ones whose inspiration is clear Overcomes the flaws of the māras and reaches awakening.’

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་གཟི་བརྗིད་དྲག་པ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན། ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Maudgalyāyana, in case you may think that at that time the bodhisattva Noble Splendor was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་གཟི་བརྗིད་དྲག་པ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was the bodhisattva Noble Splendor,

source: ངས་དེ་བཞིན་གཤེགས་པ་དེའི་འོད་དང་བསྐལ་པ་གྲངས་མེད་པ་གཉིས་ཀྱི་བར་དུ་རྗེས་སུ་འབྲེལ་ཏོ། །
en: and so I followed the light of that thus-gone one for two incalculable eons.

source: ངས་དེ་བཞིན་གཤེགས་པ་དེ་ལ་ཚིགས་སུ་བཅད་དེ་མངོན་པར་བསྟོད་དོ། །
en: It was I who spoke in verse in praise of that Thus-Gone One.

source: དེ་བཞིན་གཤེགས་པ་དེའི་མཐུས་ངས་སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ཐམས་ཅད་ཚིགས་སུ་བཅད་པ་དེ་དག་གིས་མངོན་པར་གོ་བར་བྱས་སོ། །
en: By the power of that Thus-Gone One, I was able to spread understanding with that verse throughout all those buddha realms.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན། བྱང་ཆུབ་སེམས་དཔས་ཕའི་སྟོབས་ཀྱི་གོ་ཆ་བགོ་བར་བྱ། དེ་བཞིན་གཤེགས་པའི་བཀའ་ལ་ཡང་ཐེ་ཙོམ་མེད་ཅིང་སོམ་ཉི་མེད་པར་བྱའོ།། །།
en: Therefore, Maudgalyāyana, bodhisattvas must don the armor of the powers and not harbor any doubts or qualms about the words of the thus-gone ones.

source: མཽད་གལ་གྱི་བུ་ངས་སྐྱེ་བ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པར་བྱ་བའི་དོན་དུ། སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན། བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་ནས། ཇི་ལྟར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་བྱ་སྙམ་པའི་བར་དགེ་བའི་རྩ་བ་སྣ་ཚོགས་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created boundless roots of virtue in order to understand the path that leads to cessation as related to knowledge of birth. I did this by wondering how I could fully awaken to unsurpassed and perfect buddhahood and then teach sentient beings about the knowledge of the path that leads to cessation as related to knowledge of birth.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་དེ་བཞིན་གཤེགས་པ་འགྲོ་བ་ཐམས་ཅད་ལས་འདས་པ་ཞེས་བྱ་བ་ནས།
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past, there was a thus-gone one known as Beyond All Worlds;

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་འཇིག་རྟེན་གྱི་ཁམས་དགེ་བའི་མིག་ཅེས་བྱ་བ་བྱུང་ངོ་། །
en: he was learned and venerable, a blissful one, a knower of the world, a steersman who guided beings, unexcelled, a teacher of gods and humans, a buddha, a blessed one.

source: དེ་བཞིན་གཤེགས་པ་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་བྱང་ཆུབ་སེམས་དཔའ་མཐའ་ཡས་ཤུགས་འཆང་ཞེས་བྱ་བ་
en: The buddha realm of the thus-gone Beyond All Worlds was known as Eye of Virtue, and within it there appeared a bodhisattva named Holder of Infinite Strength.

source: བྱང་ཆུབ་སེམས་དཔའ་འབུམ་ཕྲག་བདུན་གྱི་གཙོ་བོ་བྱེད་པ། སྦྱིན་པ་དང་། ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་དང་། ཐབས་ལ་མཁས་པ་ཞིག་བྱུང་ངོ་།
en: The leader of seven hundred thousand bodhisattvas, Holder of Infinite Strength was a master of generosity, discipline, patience, diligence, concentration, insight, and skillful means.

source: དེ་དེ་བཞིན་གཤེགས་པ་འགྲོ་བ་ཐམས་ཅད་ལས་འདས་པ་དེའི་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་དེ་དག་ཆམ་དུ་འབེབས་སོ། །
en: He was always concerned with the gathering of bodhisattvas that surrounded the thus-gone Beyond All Worlds

source: སེམས་ཅན་གང་དག་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པའམ། ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་དེ་དག་ཀྱང་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ། །
en: but he also ripened followers of the vehicles of the solitary buddhas and the hearers.

source: དེ་བཞིན་གཤེགས་པ་དེ་ལ་ཡང་རིམ་གྲོ་བྱེད་དེ། མཐོང་བའི་ཆོས་དེ་ལ་བདེ་བར་གནས་པ་དག་གིས་གནས་སོ། །
en: He also served the Thus-Gone One and lived a happy life.

source: དེའི་འཇིག་རྟེན་གྱི་ཁམས་ཁྲི་ཕྲག་བརྒྱད་ཅུ་ནས་དེ་བཞིན་གཤེགས་པ་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་གི་བར་གྱི་སེམས་ཅན་རྣམས་ལ་སྤྲུལ་པ་གཏོང་སྟེ།
en: “This bodhisattva sent emanations to sentient beings in eighty thousand universes, including the buddha realm of the thus-gone Beyond All Worlds.

source: སྤྲུལ་པ་དེ་དག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ཡོངས་སུ་སྨིན་པར་བྱེད་ཡོངས་སུ་སྦྱོང་བར་བྱེད་དོ། །
en: In this way he ripened and purified the realms by means of his emanations.

source: རིགས་ཀྱི་བུ་འཇིག་རྟེན་གྱི་ཁམས་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་འདི་ནི་ཇི་ལྟར་སེམས་ཅན་དམྱལ་བ་མེད་པར་འགྱུར་བ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་མེད་པར་འགྱུར་བ་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་མེད་པར་འགྱུར་བ་དང་། ལྷ་མ་ཡིན་གྱི་རིས་མེད་པར་འགྱུར་བ་དང་།
en: The thus-gone Beyond All Worlds then asked the bodhisattva Holder of Infinite Strength, ‘Noble son, are you able to purify these innumerably many tens of thousands of universes, ensuring that there are no beings in the hells, animal realms, realms of the Lord of Death, or demigod realms?

source: ཇི་ལྟར་མི་ཁོམ་པ་ཐམས་ཅད་མེད་པར་འགྱུར་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་སྐད་ཅིག་གཅིག་དང་ལྡན་པར་འགྱུར་བ་དེ་ལྟར་ཡོངས་སུ་སྨིན་པར་ནུས་སམ།
en: Can you in a single instant purify them entirely of unfree states and endow them with the qualities of buddha realms?’

source: བྱང་ཆུབ་སེམས་དཔའ་མཐའ་ཡས་ཤུགས་འཆང་གིས། དེ་བཞིན་གཤེགས་པ་འགྲོ་བ་ཐམས་ཅད་ལས་འདས་པ་དེ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: “ ‘Blessed One,’ replied the bodhisattva Holder of Infinite Strength, ‘I can complete that task in a single instant.’

source: བཅོམ་ལྡན་འདས་སྐད་ཅིག་གཅིག་གིས་བགྱི་བ་ཡོངས་སུ་རྫོགས་པར་རྔོ་ཐོགས་ལགས་སོ། །
en: “ ‘Noble son, are you really capable of that?’ inquired the thus-gone Beyond All Worlds.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་ནུས་སམ། རིགས་ཀྱི་བུ་ད་ལྟར་གྱི་སྐྱེ་དགུ་ཚེ་རིང་བ་ཚེའི་ཚད་བསྐལ་པ་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་དེ
en: ‘Noble son, beings with long lifespans now live for innumerably many tens of thousands of eons,

source: གང་བྱང་ཆུབ་སེམས་དཔའ་ལེ་ལོ་ཀུན་ཡོད་པ་དེ་ཚེའི་ངོ་བོ་གཅིག་ཐོབ་པས་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ། །
en: and yet in a single life a bodhisattva who possesses all forms of laziness can still bring them to maturation.

source: རིགས་ཀྱི་བུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་སངས་རྒྱས་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་རྣམས་ཀྱིས་ཡང་དང་ཡང་དུ་ངའི་མིག་གིས་མཐོང་བའི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་སྤྱད་པ་ཡོངས་སུ་སྤྱད་དེ
en: Noble son, with my eyes I perceive that innumerably many tens of thousands of buddhas keep coming to this buddha realm to carry out their activities.

source: དེ་བཞིན་དུ་སངས་རྒྱས་ཀྱི་ཞིང་སངས་རྒྱས་མང་པོས་ཡོངས་སུ་མ་བཏུལ་བ་གང་ཡང་མེད་དོ། །
en: And there are no buddha realms that have not in this way been cultivated by numerous buddhas.

source: འདི་ལྟར་སངས་རྒྱས་ཀྱི་ཞིང་འདི་དེ་ལྟར་སངས་རྒྱས་མང་པོས་ཡོངས་སུ་སྨིན་པར་མཛད་དོ། །
en: Wherever there is a buddha realm there will also be numerous buddhas who bring it to maturation.

source: ཇི་ལྟར་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཉེ་བར་བྱུང་བ་དེ་ལྟར་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ལྟ་བུ་གང་ཡང་མེད་དོ། །
en: Just as they appear in this realm, the blessed buddhas appear in all other buddha realms as well.

source: རིགས་ཀྱི་བུ་དེ་ལྟ་བས་ན་ཁྱོད་དེ་བཞིན་གཤེགས་པའི་བཀས་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ཡོངས་སུ་སྨིན་པ་དང་། ཡོངས་སུ་སྦྱང་བ་བྱ་བར་ངེས་པ་བསྐྱེད་ཅིག་
en: Therefore, noble son, be confident that you can ripen and cultivate this buddha realm by means of the Thus-Gone One’s teaching.

source: རིགས་ཀྱི་བུ་ཁྱེད་ཀྱང་སངས་རྒྱས་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དག་ལ་དགེ་བའི་རྩ་བ་བསྐྱེད། ཤེས་རབ་རྣོ་བ་སྙིང་རྗེ་མཚུངས་པ་མེད་པ་དང་ལྡན་ན།
en: Noble son, if you create roots of virtue before innumerably many tens of thousands of buddhas, and if you possess sharp insight and incomparable compassion,

source: ཁྱོད་ཀྱི་ཚེ་གཅིག་པོ་འདིས་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་ནུས་སམ།
en: will you then not be able to ripen all beings in this one single life of yours?’

source: གལ་ཏེ་བདག་ལ་དེ་བཞིན་གཤེགས་པས་བཀའ་སྩལ་ན། གང་བདག་དེ་བཞིན་གཤེགས་པའི་བཀས་སེམས་ཅན་རྣམས་ལ་གློ་བ་བརྩེ་བར་བཟུང་སྟེ།
en: ‘If the Thus-Gone One so instructs me, I shall embrace sentient beings with love.

source: བཅོམ་ལྡན་འདས་ཀྱི་བཀའ་བཞིན་དུ་བསྐལ་པ་གྲངས་མ་མཆིས་པར་མེ་མ་མུར་གྱི་འོབས་དུ་བ་མ་མཆིས་པར་མཆིས་པ་དེ་ཡང་སྤྲོའོ། །
en: To fulfill the Thus-Gone One’s wishes I would gladly remain for incalculably many eons within a pit of burning embers.’

source: དེ་བཞིན་གཤེགས་པ་འགྲོ་བ་ཐམས་ཅད་ལས་འདས་པ་དེ་ཕུང་པོ་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་སོ། །
en: “When the bodhisattva had spoken these words, the thus-gone Beyond All Worlds passed beyond suffering within the field of nirvāṇa free from any remainder of the aggregates.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་མཐའ་ཡས་ཤུགས་འཆང་དེས། དེ་བཞིན་གཤེགས་པ་དེའི་སྐུ་གདུང་རྒྱ་ཆེར་བྱས་ནས་མཆོད་པ་བྱས་སོ། །
en: Upon the Thus-Gone One’s passing, the bodhisattva Holder of Infinite Strength offered elaborate worship to the Thus-Gone One’s relics.

source: དེ་བཞིན་གཤེགས་པའི་བཀའ་དེ་རྗེས་སུ་དྲན་པ་ན་སེམས་ཅན་རྣམས་ལ་སྙིང་བརྩེ་བར་བཟུང་ནས་སྤྲུལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་སྤྲུལ་ཏོ། །
en: Keeping in mind his instructions, he embraced sentient beings with love and sent forth boundlessly many quintillions of emanations.

source: དེས་སངས་རྒྱས་ཀྱི་ཞིང་དེ་བྱང་ཆུབ་སེམས་དཔའ་ཕྱིར་མི་ལྡོག་པ་རྣམས་ཀྱིས་མེ་ཏོག་བཞིན་ཀུན་ཏུ་བཀང་ནས་དེ་ཚེའི་འདུ་བྱེད་བཏང་ངོ་། །
en: In this way the buddha realm became like a meadow full of the flowers of irreversible bodhisattvas before finally the bodhisattva himself passed away.

source: མཽད་གལ་གྱི་བུ་ཁྱོད་དེའི་ཚེ་དེའི་དུས་ན། བྱང་ཆུབ་སེམས་དཔའ་མཐའ་ཡས་ཤུགས་འཆང་ཞེས་བྱ་བར་གྱུར་པ། དེ་གཞན་ཡིན་པར་སེམས་ན། ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Maudgalyāyana, in case you may think that at that time the bodhisattva Holder of Infinite Strength was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་མཐའ་ཡས་ཤུགས་འཆང་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was the bodhisattva Holder of Infinite Strength.

source: ངས་སངས་རྒྱས་ཀྱི་ཞིང་དེ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མེ་ཏོག་བཞིན་ཀུན་ཏུ་བཀང་།
en: It was I who filled that buddha realm with the flowers of bodhisattvas,

source: སངས་རྒྱས་ཀྱི་གདུང་ཡང་དག་པར་སྤེལ།
en: and I who made the Buddha’s tradition flourish,

source: དེ་བཞིན་གཤེགས་པའི་སྐུ་གདུང་རྒྱ་ཆེར་བྱས་ཏེ། མཆོད་པ་བྱས་ནས་དུས་བྱས་སོ། །
en: and I who offered elaborate worship to the Thus-Gone One’s relics.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་སངས་རྒྱས་ཀྱི་གདུང་མི་གཅད་པར་བྱ་བའི་ཕྱིར་འབད་པར་བྱས་ནས། ཕྱིས་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas must endeavor to keep the Buddha’s tradition intact, and so awaken to perfect buddhahood in the future.”

source: མཽད་གལ་གྱི་བུ་ངས་འདོད་པའི་ཟག་པ་ཤེས་པར་བྱ་བའི་དོན་དུ། སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན། བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། འདོད་པའི་ཟག་པ་ཤེས་པ་སེམས་ཅན་རྣམས་ལ་ཇི་ལྟར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་བྱ་སྙམ་ནས། དགེ་བའི་རྩ་བ་སྣ་ཚོགས་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created boundless roots of virtue in order to understand the defilement of desire. I did this by wondering how I could fully awaken to unsurpassed and perfect buddhahood and then teach sentient beings about the knowledge of the defilement of desire.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན། རྒྱལ་པོ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་རང་བཞིན་གྱི་རྗེས་སུ་འཇུག་པ་ཞེས་བྱ་བ།
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a king known as Perceiving the Nature of All Beings.

source: མཛངས་ཤིང་གསལ་ལ་ཡིད་གཞུངས་པ། སེམས་ཅན་རྣམས་ཀྱི་དབང་པོའི་ཚོགས་རྟོག་པ་ལ་མཁས་པ་ཞིག་བྱུང་སྟེ།
en: Astute and intelligent, the king was an expert in recognizing the compositions of the faculties of sentient beings.

source: སེམས་ཅན་གང་དག་གཟུགས་ལ་མོས་པ་དེ་དག་གི་གཟུགས་ལ་འདོད་ཆགས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས།
en: Thus he correctly understood the specific desires of beings yearning for physical form.

source: དེ་སེམས་ཅན་འདི་དག་གཟུགས་ལ་འདོད་ཆགས་པས་ཡོངས་སུ་གདུངས་ཤིང་གཟུགས་ལ་འདོད་ཆགས་པས་བསྲེགས་པ་མཐོང་ངོ་། །
en: He would see how those beings suffered from, and were scorched by, their desires for physical forms.

source: དེ་སེམས་ཅན་དེ་དག་གི་གཟུགས་ལ་འདོད་ཆགས་སྤང་བའི་ཐབས་སེམས་ཏེ།
en: “The king was concerned about finding ways for beings to relinquish their desire for physical forms, and so he thought,

source: ཐབས་གང་གིས་སེམས་ཅན་དེ་དག་གཟུགས་ལ་འདོད་ཆགས་སྐྱེས་པ་མི་སྐྱེད་པ་དང་། སྐྱེས་པ་ཡང་སྤོང་བར་འགྱུར།
en: ‘What methods might there be for sentient beings to relinquish their present desire for physical forms and avoid producing any more?

source: སེམས་ཅན་འདི་དག་གཟུགས་ལ་འདོད་ཆགས་པས་ཤིན་ཏུ་གདུངས།
en: These beings are tormented and scorched by their desire for form.

source: འདོད་ཆགས་ཀྱིས་ཡོངས་སུ་བསྲེགས་པའི་སེམས་དེས་འཆི་བའི་དུས་བྱས་ཤིང་དེ་དག་སེམས་ཅན་དམྱལ་བར་སྐྱེ་བར་མ་གྱུར་ཅིག །
en: At the time of their death, may their desiring minds not compel them to take birth in the hells!

source: འདོད་ཆགས་ཀྱི་མེ་དེས་ཤིན་ཏུ་གདུངས་པ་དེའི་རྐྱེན་གྱིས་སེམས་ཅན་དམྱལ་བ་པའི་མེས་གདུངས་ཏེ།
en: Tormented by the fires of desire, beings are born in hells where infernal fires torment them.

source: དེ་དག་ཤིན་ཏུ་གདུང་བ་གཉིས་ཀྱིས་འཆི་བའི་ཞགས་པ་ལས་མི་འགྲོལ་ལོ། །
en: This double torment keeps them tied in the shackles of death.

source: སྡུག་བསྔལ་གྱི་གནོད་པས་སྐྱེ་བ་ན་ཡང་འབྲེལ། འཆི་བ་ན་ཡང་འབྲེལ་འཇིག་རྟེན་འདི་ནས་འཇིག་རྟེན་ཕ་རོལ་ཏུ་འགྲོ་བ་ན་ཡང་འབྲེལ་ཏོ་སྙམ་ནས།
en: Thus, oppressed by suffering they take birth, die, and wander from this world to the next.’

source: དེ་ཐབས་ཚོལ་བ་ན་འདི་ལྟར་ཡོངས་སུ་འཇལ་ཏེ།
en: “The king searched for a right method, and then concluded,

source: བྱིས་པ་དག་རྟོག་པའི་དབང་གིས་གཙང་བའི་འདུ་ཤེས་ཀྱིས་བཅིངས་ཏེ། སྟོང་པ་ཉིད་ཀྱི་ངོ་བོ་དང་བྲལ་བ་ཁ་དོག་ཙམ་གཉིས་པ་ཙམ་མོ། །
en: ‘Due to conceptualization, childish beings become tied up by the idea of the clean and miss the nature of emptiness, while mere color is merely second.

source: དེ་ཡང་གཅིག་ཏུ་བསྡུས་ན་མི་གཙང་བ་ཉིད་དེ། འདི་ལ་གཙང་བ་ཉིད་གང་ཡང་མེད་དོ། །
en: However, impurity subsumes it all, for here there is nothing whatsoever that is clean.

source: མགལ་མེ་བསྐོར་བ་སྣང་བ་བཞིན་དུ་ལོག་པར་འཛིན་པས། འདོད་ཆགས་འཇུག་པ་གཙང་བར་འབྲེལ་པ་དེ་ཤིན་ཏུ་འཛིན་ཏོ། །
en: Still, as when a firebrand is spinning, beings misapprehend appearances, and so they act with desire, believing that they are relating to something that is pure.

source: དེ་ལྟར་སྐྱེ་བ་ན་ཡང་འབྲེལ། རྒ་བ་ན་ཡང་འབྲེལ་འཆི་བ་ན་ཡང་འབྲེལ་བར་བྱེད་དོ། །
en: Thus they remain bound throughout birth, aging, and death.

source: འཁོར་བར་ཤིན་ཏུ་རྒྱུག་པ་དག་སྔོན་གྱི་མཐའ་མི་ཤེས་སོ་སྙམ་ནས།
en: Racing around in circles, they do not understand where all this begins.’

source: དེ་སེམས་ཅན་དེ་དག་གི་གང་མི་གཙང་བ་ཡང་དང་ཡང་དུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་སྟོན་ཏོ། །
en: “With this understanding the king repeatedly taught sentient beings correctly about the unclean.

source: དེ་དེ་དག་གི་མི་གཙང་བ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་སྟོན་པ་ན། སེམས་ཅན་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་རྣམས་ཀྱིས་མི་གཙང་བར་འདུ་ཤེས་པ་ཡོངས་སུ་ཤེས་ཤིང་མི་གཙང་བའི་བློར་ཞུགས། ཆོས་རྣམས་ཀྱི་ངོ་བོ་ཉིད་དང་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་ཡོངས་སུ་ཤེས་སོ། །
en: Thereby, innumerably many tens of thousands of beings understood the concept of impurity, began to think in terms of the unclean, and comprehended the essential nature of all phenomena.

source: ཡོངས་སུ་ཤེས་ནས་སེམས་ཅན་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དག་མི་གཙང་བའི་འདུ་ཤེས་ཀྱིས་བཟློག་ནས།
en: With such understanding innumerably many tens of thousands of beings reversed their desires by means of the concept of impurity.

source: འདོད་པ་དག་གིས་འདོད་ཆགས་དང་བྲལ་ནས་ཚངས་པའི་འཇིག་རྟེན་དུ་སྐྱེས་སོ། །
en: Thus, free from the desires of the desire realm, they were born in the world of Brahmā.

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་དེའི་དུས་ན། རྒྱལ་པོ་སེམས་ཅན་ཀུན་གྱི་རང་བཞིན་གྱི་རྗེས་སུ་འཇུག་པ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན། ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Maudgalyāyana, in case you may think that at that time the king Perceiving the Nature of All Beings was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན། རྒྱལ་པོ་སེམས་ཅན་ཀུན་གྱི་རང་བཞིན་གྱི་རྗེས་སུ་འཇུག་པ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was the king Perceiving the Nature of All Beings.

source: ངས་སྲོག་ཆགས་ཁྲི་ཕྲག་དཔག་ཏུ་མེད་པ་དག་མི་གཙང་བའི་འདུ་ཤེས་ཀྱིས་བཟློག་ནས་ཚངས་པའི་འཇིག་རྟེན་དུ་བསྐྱེད་དོ། །
en: In this way I reversed the desires of innumerably many tens of thousands of beings so that they took birth in the world of Brahmā.

source: དེ་དག་ཐམས་ཅད་ཀྱང་གཟུགས་ཀྱི་རང་བཞིན་རབ་ཏུ་ཤེས་ཤིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ། །
en: Since they also all understood the nature of form correctly, they became irreversible from unsurpassed and perfect awakening.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན། བྱང་ཆུབ་སེམས་དཔས་གཟུགས་ཀྱི་རང་བཞིན་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་ཡོངས་སུ་ཤེས་པར་བྱ། དེ་བཞིན་དུ་སེམས་ཅན་རྣམས་ལ་ཡང་བསྟན་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas must correctly understand the nature of form, and they must explain their understanding to sentient beings.
